# Menggabungkan dua Pandas Data Frame

# import Module

In [1]:
import pandas as pd
import numpy as np

# Membuat Data Frame

In [2]:
n_rows = 5
n_cols = 5
columns = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=columns)
df

    A   B   C   D   E
0  14  17  17   9  12
1  10   5  12  19  10
2  16  14  13   8   7
3   5   5   3   8  10
4   6   7   5  18  17

In [3]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A   B   C  D   E
0  14  17  17  9  12
2  16  14  13  8   7
3   5   5   3  8  10

In [4]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A   B   C   D   E
1  10   5  12  19  10
2  16  14  13   8   7
4   6   7   5  18  17

# Menggabungkan Dua Data Frame

In [5]:
df_inner = pd.merge(df1,df2,how='inner')
df_inner

    A   B   C  D  E
0  16  14  13  8  7

In [6]:
df_outer = pd.merge(df1,df2,how='outer')
df_outer

    A   B   C   D   E
0  14  17  17   9  12
1  16  14  13   8   7
2   5   5   3   8  10
3  10   5  12  19  10
4   6   7   5  18  17